; domain
(define (domain gripper-strips)
 (:requirements :strips :typing :constraints) 
 (:types type_2 object type_1 type_3)
 (:predicates (pred_3 ?v3 - type_1 ?v8 - type_2)
 	      (pred_2 ?v6 - object ?v8 - type_2)
	      (pred_4 ?v3 - type_1 ?v7 - type_3)
	      (pred_1 ?v3 - type_1 ?v6 - object ?v7 - type_3))

   (:action op_2
       :parameters  (?v3 - type_1 ?v5 ?v2 - type_2)
       :precondition (and  (pred_3 ?v3 ?v5))
       :effect (and  (pred_3 ?v3 ?v2)
		     (not (pred_3 ?v3 ?v5))))

   (:action op_1
       :parameters (?v3 - type_1 ?v4 - object ?v1 - type_2 ?v7 - type_3)
       :precondition  (and  (pred_2 ?v4 ?v1) (pred_3 ?v3 ?v1) (pred_4 ?v3 ?v7))
       :effect (and (pred_1 ?v3 ?v4 ?v7)
		    (not (pred_2 ?v4 ?v1)) 
		    (not (pred_4 ?v3 ?v7))))

   (:action op_3
       :parameters (?v3 - type_1 ?v4 - object ?v1 - type_2 ?v7 - type_3)
       :precondition  (and  (pred_1 ?v3 ?v4 ?v7) (pred_3 ?v3 ?v1))
       :effect (and (pred_2 ?v4 ?v1)
		    (pred_4 ?v3 ?v7)
		    (not (pred_1 ?v3 ?v4 ?v7)))))

; problem
(define (problem gripper-1-4-3)
(:domain gripper-strips)
(:objects obj_10 - type_1
obj_08 obj_07 - type_3
obj_09 obj_06 obj_03 obj_01 - type_2
obj_05 obj_04 obj_02 - object)
(:init
(pred_3 obj_10 obj_06)
(pred_4 obj_10 obj_08)
(pred_4 obj_10 obj_07)
(pred_2 obj_05 obj_03)
(pred_2 obj_04 obj_01)
(pred_2 obj_02 obj_09)
)
(:goal
(and
(pred_2 obj_05 obj_01)
(pred_2 obj_04 obj_09)
(pred_2 obj_02 obj_03)
)
)

(:constraints
  (always (forall (?b - object)
           (not (pred_1 obj_10 ?b obj_07))))
)
)

; plan
1. (op_2 obj_10 obj_06 obj_09)
   deleted: (pred_3 obj_10 obj_06)
   added: (pred_3 obj_10 obj_09)
   goals met: 0 of 3
2. (op_1 obj_10 obj_02 obj_09 obj_08)
   deleted: (pred_2 obj_02 obj_09) (pred_4 obj_10 obj_08)
   added: (pred_1 obj_10 obj_02 obj_08)
   goals met: 0 of 3
3. (op_2 obj_10 obj_09 obj_03)
   deleted: (pred_3 obj_10 obj_09)
   added: (pred_3 obj_10 obj_03)
   goals met: 0 of 3
4. (op_3 obj_10 obj_02 obj_03 obj_08)
   deleted: (pred_1 obj_10 obj_02 obj_08)
   added: (pred_2 obj_02 obj_03) (pred_4 obj_10 obj_08)
   goals met: 1 of 3
5. (op_1 obj_10 obj_05 obj_03 obj_08)
   deleted: (pred_2 obj_05 obj_03) (pred_4 obj_10 obj_08)
   added: (pred_1 obj_10 obj_05 obj_08)
   goals met: 1 of 3
6. (op_2 obj_10 obj_03 obj_01)
   deleted: (pred_3 obj_10 obj_03)
   added: (pred_3 obj_10 obj_01)
   goals met: 1 of 3
7. (op_3 obj_10 obj_05 obj_01 obj_08)
   deleted: (pred_1 obj_10 obj_05 obj_08)
   added: (pred_2 obj_05 obj_01) (pred_4 obj_10 obj_08)
   goals met: 2 of 3
8. (op_1 obj_10 obj_04 obj_01 obj_08)
   deleted: (pred_2 obj_04 obj_01) (pred_4 obj_10 obj_08)
   added: (pred_1 obj_10 obj_04 obj_08)
   goals met: 2 of 3
9. (op_2 obj_10 obj_01 obj_09)
   deleted: (pred_3 obj_10 obj_01)
   added: (pred_3 obj_10 obj_09)
   goals met: 2 of 3
10. (op_3 obj_10 obj_04 obj_09 obj_08)
   deleted: (pred_1 obj_10 obj_04 obj_08)
   added: (pred_2 obj_04 obj_09) (pred_4 obj_10 obj_08)
   goals met: 3 of 3
